# Filtering data
- Filtering is widely used while working with the huge amount of data.
- Filtering allows us to extract specific data from the huge dataset for analysis.
- A common operation in data analysis is to filter values based on a condition or multiple conditions.

In [1]:
# Impoerting Pandas library

import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\sures\3D Objects\Data Science\1) Offline Python for Data Science (Aishwarya Mate)\2) GitHub Aishwarya Mam\3) Datasets-main\Salaries.csv")
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [3]:
# Extract records where gender = female

df['gender'] == 'Female'

0     False
1     False
2     False
3     False
4     False
      ...
73     True
74     True
75     True
76     True
77     True
Name: gender, Length: 78, dtype: bool

In [4]:
# Extract only those records where gender = female

# Syntax: dataset variable[dataset variable['Criteria 1'] == 'Criteria 2']

df[df['gender'] == 'Female']

# This method is called as Masking

         rank discipline  phd  service  gender  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
52       Prof          A   12        0  Female  105000
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [5]:
# Extract only those records where rank = Prof and gender = female
# For multiple cindition

# Syntax: dataset variable[(dataset variable['Criteria a1'] == 'Criteria a2') & (dataset variable['Criteria b1'] == 'Criteria b2')]

df[(df['rank'] == 'Prof') & (df['gender'] == 'Female')]

# Note:
# & is called as bitwise and operator and this is used when we need to satisfy both conditions.
#  | is called as bitwise or operator and this is used when we need to satisfy condion 1 or condition 2.

    rank discipline  phd  service  gender  salary
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
48  Prof          B   17       17  Female  111512
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
52  Prof          A   12        0  Female  105000
58  Prof          B   36       26  Female  144651
63  Prof          A   29       27  Female   91000
65  Prof          A   36       19  Female  117555
67  Prof          A   17       11  Female   90450
69  Prof          A   28        7  Female  116450
72  Prof          B   24       15  Female  161101
73  Prof          B   18       10  Female  105450
75  Prof          B   17       17  Female  124312
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [6]:
# Extract only those records where rank = Prof or gender = female
# For multiple cindition

# Syntax: dataset variable[(dataset variable['Criteria a1'] == 'Criteria a2') | (dataset variable['Criteria b1'] == 'Criteria b2')]

df[(df['rank'] == 'Prof') | (df['gender'] == 'Female')]

# Note:
#  | is called as bitwise or operator and this is used when we need to satisfy condion 1 or condition 2.
# & is called as bitwise and operator and this is used when we need to satisfy both conditions.

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[67 rows x 6 columns]

In [7]:
# Gender is female and salary is greater than 150000

df[(df['gender'] == 'Female') & (df['salary'] > 150000)]

    rank discipline  phd  service  gender  salary
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [8]:
# What is the average salary of rank = prof & gender = female?

# Syntax: dataset variable[(dataset variable['Criteria a1'] == 'Criteria a2') | (dataset variable['Criteria b1'] == 'Criteria b2')][Criteria c1].mean(), max(), std, more

df[(df['rank'] == 'Prof') & (df['gender'] == 'Female')]['salary'].mean()

121967.61111111111

In [9]:
# What is the average salary of rank prof

df[df['rank'] == 'Prof']['salary'].mean()

123624.80434782608

In [10]:
# What is the average service of rank AssocProf and discipline is A?

df[(df['rank'] == 'AssocProf') & (df['discipline'] == 'A')]['service'].mean()

15.8

In [11]:
# What is the average salary of rank Prof and discipline is A?

df[(df['rank'] == 'Prof') & (df['discipline'] == 'A')]['salary'].mean()

111935.69565217392

In [12]:
# Unique values in rank column

df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

**Groupby function**
- Instead of calculating average salaries separately, we can use pandas groupby method.

**Syntax:** dataset variable.groupby('categorical column name')['numerical column name].mean()

In [13]:
# Grouby aggregate method
# Syntax: dataset variable.groupby('categorical column name')['numerical column name].mean()

df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

In [14]:
# Median of phd for male and female

df.groupby('gender')['phd'].median()

gender
Female    17.0
Male      21.0
Name: phd, dtype: float64

In [15]:
# agreegate function in one line(min, max, mean, median)
# Syntax: dataset variable.groupby('categorical column name')['numerical column name].agg({'mean', 'min', 'max', 'median'})

df.groupby('rank')['salary'].agg({'mean', 'min', 'max', 'median'})

             median    min           mean     max
rank
AssocProf  103613.0  62884   91786.230769  119800
AsstProf    78500.0  63100   81362.789474   97032
Prof       123321.5  57800  123624.804348  186960

In [16]:
df[(df['rank']=='Prof') & (df['discipline']=='A')]['salary'].mean()

111935.69565217392

In [17]:
df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

# In-Class Activity

In [18]:
ds = pd.read_csv(r'C:\Users\sures\3D Objects\Data Science\1) Offline Python for Data Science (Aishwarya Mate)\2) GitHub Aishwarya Mam\3) Datasets-main\nba.csv')
ds.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [19]:
#Extract the data where Team is boston celtics and Weight is less than 100
#What is the avearge salary of players of team 'Los Angeles Lakers'.
#What is the average salary of player based of various position?
#Which players belong to San Diego State college.
#Which player from Toronto Raptors team has the highest salary?

In [20]:
#Extract the data where Team is boston celtics and Weight is less than 100

ds[(ds['Team'] == 'Boston Celtics') & (ds['Weight'] < 100)]

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary]
Index: []

In [21]:
#What is the avearge salary of players of team 'Los Angeles Lakers'.

ds[ds['Team'] == 'Los Angeles Lakers']['Salary'].mean()

4784695.4

In [22]:
#What is the average salary of player based of various position?

ds.groupby('Position')['Salary'].mean()

Position
C     5.967052e+06
PF    4.562483e+06
PG    5.077829e+06
SF    4.857393e+06
SG    4.009861e+06
Name: Salary, dtype: float64

In [23]:
#Which players belong to San Diego State college.
ds[ds['College'] == 'San Diego State']

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
301,Kawhi Leonard,San Antonio Spurs,2.0,SF,24.0,6-7,230.0,San Diego State,16407500.0

In [24]:
#Which player from Toronto Raptors team has the highest salary?
ds[ds['Team'] == "Toronto Raptors"].max()

C:\Users\sures\AppData\Local\Temp\ipykernel_7424\1591643002.py:2: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  ds[ds['Team'] == "Toronto Raptors"].max()

Name          Terrence Ross
Team        Toronto Raptors
Number                 92.0
Position                 SG
Age                    36.0
Height                  7-0
Weight                255.0
Salary           13600000.0
dtype: object

In [25]:
ds[ds['Team'] == "Toronto Raptors"]['Salary'].max()

13600000.0

In [26]:
ds[(ds['Team'] == "Toronto Raptors") & (ds['Salary'] == 13600000.0)]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
63,DeMarre Carroll,Toronto Raptors,5.0,SF,29.0,6-8,212.0,Missouri,13600000.0